{"title":"Applications and Positions","content":"<p>Learn about our positions and <a class='clickable' onclick=\"scrollToNoMenu('#application-form')\">fill out our application form</a>!</p><h2>Writer</h2><p>Writers write! They write the wonderful articles that you see on this site and in our monthly issues.</p><h3>Who are you?</h3><p>You are enthusiastic to write newspaper style articles.<br> You enjoy employing your creativity in your writing.<br> You enjoy comedy.</p><h3>What do you do?</h3><p>You write newspaper style articles about issues focussed on the school.<br> You work with editors to improve your articles.</p><h2>Editor</h2><p>Editors edit!</p><h3>Who are you?</h3><p>You have a keen eye with grammar.<br> You enjoy comedy.<br> You pay attention to the little details.</p><h3>What do you do?</h3><p>You help writers and comic artists with their writing.<br> You make sure our articles are flawless and fact-checked.</p><h2>Comic artist</h2><p>Comic artists draw comics! They contribute to the artistic talent of the paper.</p><h3>Who are you?</h3><p>You are enthusiastic to design and create comics.<br> You enjoy creating visuals to communicate ideas effectively.<br> You enjoy comedy.</p><h3>What do you do?</h3><p>You create comics (one to four panels) about issues focussed on the school.<br> You work with editors to improve your writing and visuals in your comics.</p><h2>Image editor</h2><p>Image editors edit images! They create images for each article.</p><h3>Who are you?</h3><p>You are enthusiastic to design works supporting articles.<br> You enjoy creating impactful visuals using existing photographs.</p><h3>What do you do?</h3><p>You create images using image editors as associated pictures for articles.<br> You write captions for your images.<br> You work with editors to improve your writing and visuals in your work.</p><h2>Layout Designer</h2><p>Layout designers design the layout!</p><h3>Who are you?</h3><p>You are good with planning out the big picture.<br> You have an eye for aesthetic.<br> You are good at organizing things into just the right places.</p><h3>What do you do?</h3><p>You help neatly lay out and organize the content of our newspaper.<br> You gather comics, articles, and illustrations from other team members and compile them effectively.</p><h2>Social Media Manager</h2><p>Social media managers manage our social media accounts!</p><h3>Who are you?</h3><p>You are experienced with using Instagram and Facebook.<br> You have an artistic eye as well as a talent to write convincingly.</p><h3>What do you do?</h3><p>You create posts for our social media accounts for announcements and updates.<br> You work with image editors and editors to make sure that the posts are both visually-appealing and well-written.</p><h2>Website Developer</h2><p>Website developers develop the website!</p><h3>Who are you?</h3><p>You're experienced with static website building, namely HTML and JavaScript. Promises and CSS would be a bonus.</p><h3>What do you do?</h3><p>You help maintain the website.<br> You work with the writers and image editors to make sure all of our articles are posted on the website.</p><p><br></p><iframe id='application-form' src='https://forms.gle/sduKa2fi7meWcFyRA' class='flex-grow' style='width:100%;height:1800px'></iframe>"}
